 
/* ############################################################################
*  이오스(EOS) 초간단 설명서
##############################################################################*/

/*****************************************************
*   eos 란
*   https://www.youtube.com/watch?v=kjysO6_8NQA
******************************************************/
 	- 부동산에 비유한 이오스
 	   1. 땅 가격이 오를때까지 기다린다
 	   2. 건물을 세운다  :  DAPP을 만든다. 
 	   3. 땅을 임대한다. : 네트워크 자원을 임대한다.   예) chintai 
 	   
  - 이오스란
    1. EOS라는 네트워크(컴퓨터)가 있고 지분에 따라 해당 네트워크 연산력을
       사용할 수 있는 권한이 주어진다. 
    2. ram , cpu, network 등 자원의 일정량을 소유하고 있는 것(사용권한)
    
    3. 21명의 BP 네트워크 유지하는 사람이 있고
      - 송금 수수료 0
      - 빠른 블록생성  : 0.5초 

 /*****************************************************
*   EOSYS BP 당선
******************************************************/
      
-  https://www.youtube.com/watch?v=VOwwQih1wqw&list=PL2xzNQCuJnl77igHweHSlT1gWIz-9tcww
- BP  (국회의원)
   1. 21명의 BP 존재함
   2. BP = 대표자 = 노드 = 네트워크 유지 보수
   3. EOS 생태계를 발전 시키기 위해 공약
   4. EOS 생태계 발전을 위해 기여
   
 - BP 순위
    https://portal.eoseoul.io/votelogin

/*****************************************************
*   지갑 : 그레이메스 tool 
******************************************************/

 1. 구글 크롬 설치
 2. https://github.com/greymass/eos-voter/releases  접속
 3. eos-voter 실행파릴 다운로드 실행
 4. wallet api url 입력   :  https://eos.greymass.com
 5. EOS.IO 에서 받은 퍼블릭키와 프라이빗키 입력
 6. 로그인 암호입력 - 개정지갑생성 

/*****************************************************
*   지갑 : 스캐터 
******************************************************/
 - 스캐터를 번 저 설치 
 - 송금 시 사용되는 프로그램
     https://eostoolkit.io/search
    	 
 /*****************************************************
 * eos 업비트 계정 
 ******************************************************/

  - 주소 : eosusrwallet
  - 메모 : 4fe57890-572f-4e3c-9169-dfa78624b9e1
 
업비트  2.89045161
0.9067
 
 /*****************************************************
 * 검색방법
 ******************************************************/

1. 순위 볼 수 있는 사이트 
  - https://www.eospia.com/  gqztgmrwgene
	 
2. 계정 정보 검색 : unstaked , staked, ,메모리, cpu, 네트워크 등 
 - https://eosflare.io/     : 검색  gqztgmrwgene 
 -  
 
 3. eos 내 계정에 포크 받은 종류까지 다 보기 
    https://www.eospia.com/ex/lanirexmalo1
    	
4. eos flare :  https://eosflare.io/account/lanirexmalo1
	
5. eos Park :  https://eospark.com/account/lanirexmalo1
	
6. 거래소로 이체 : https://www.scattellet.com/
    	
/* ############################################################################
*  이오스 계정 만들기 
##############################################################################*/
 
 /*****************************************************
 * eos account  이오스 계정 
 ******************************************************/
 -	 https://irex.io/accounts/new
	 1. 
	 
 - 퍼블릭키 
 - 프라잇키 
 /*****************************************************
 *  설 맞이 기념 EOS계정 신규 생성 이벤트
 ******************************************************/
 
 
 https://eosflare.io/account/lanirexmalo1
 
	 https://www.youtube.com/watch?v=PI-U2j2H7CY&list=PLrc6LoawuG_HNvgmK2Azoydy9h3_-B-CA&index=3
 
 /*****************************************************
  *  스테이킹 언스테이킹 하는 사이트 
  ******************************************************/
 
 https://eostoolkit.io/home
	 
 /*****************************************************
  *  리눅스에서 만들기  
  ******************************************************/
	 linux eos account create
	 https://www.youtube.com/watch?v=vwR3Sqquqc0&index=2&list=PLE4o_J32st8GsrBWXPLRY9ZWqf3kInD58
     https://www.youtube.com/watch?v=i2ccUNta7dQ
			 
	 EOS Create A Smart Contract Part1 - Accounts & Actions (Dawn3.x)
	 
	 cleos --url  http://dev.cryptolions.io:38888 system newaccount skunkape hogzilla
		 --stake-net "0.0100 EOS" --stake-cpu "0.0100 EOS" --buy-ram-kbytes "3"   skunkape퍼블릿키  hogzilla퍼블릿키 
	 
 /* ############################################################################
 *  eos 거래소 
 ##############################################################################*/

- 거래소 : https://chaince.com/trade/iqeos
- 강의 : https://www.youtube.com/watch?v=5fZ-1wc8quY
	
		 EOS로 에어드랍 받은 토큰 거래소로 보내기 - Chaince(체인스) 거래소, CET 토큰 (이벤트 포함)
		 
		 
		 
		 
		 
		 
		 
		 
		 
 