 
/* ############################################################################
*  
##############################################################################*/

/*****************************************************
*  가글  구강철결제 
******************************************************/
1. 충치 : 뮤탄스균 제거하면 성인이되어서도 충치 예방에 된다 
 
2. 성분 크게 3가지
  
   - 플루오르화 나트륨 계열
      - 뮤탄스균 잘 죽이지 못한다 , 다른 세정제 보다 성능이 떨어진다   
      - 단점 : 살균력 떨어짐
      - 아이들이 사용하면 안전함 
      
   - CPC : 염화세틸피리다늄
	   - 세틸피리디늄염화물수화물 = 염화세틸피리디늄  = 세필피리디늄크롤라이드   ==> 모두 같은 말
	   - 뮤탄스균 잘 죽인다 
	   - 치아 표면 100%, 구강내부에서 100% 살균 효과 
	   - 단점 : 양치후 바로 사용하면 구강이 누렇게 변한다. 
	                   예방하려면 양치후 30분 뒤에 해야함
	   
  - 에센셜 오일 계열 : 타르색소 포함됨
     - 치아 70%, 구강내부 91%
     - 단점 : 타르색소 포함됨 (미국 FDA 승인했지만 유럽에서는 사용안함)
     - 타르색소는 어린이 사용 시 : 천식이나 ADHD 유발할 숫도 있다는 유해성 논란 제기됨
     
 
 


