 
/* ############################################################################
*  실내공기정화식물순위 TOP5 - 나사 공식선정/미세먼지/인테리어화분/거실화분
##############################################################################*/

/*****************************************************
* 1. 아레카 야자 
******************************************************/
물주기 : 여름(1주일), 겨울(10일), 잎에 물을 뿌려주는게 좋다
햇빛 : 열대식물 10~12도 유지 , 직사광선 피해라, 햇빛이 없어도 잘 자람 
 - 줄기가 황색을 나타내는 것은 병든게 아니라 원래 특성이다 
- 잎이 처지거나 노랗게 변하면 물부족보다는 물이 많아서 그렇다. 약간 부족하게...

/*****************************************************
* 2. 관음죽
******************************************************/
관음죽은 낮은 기온에서도 아랑곳않는 내한성을 자랑하고, 병충해에도 강한 식물입니다. 
암모니아를 잘 흡수하는 특징이 있어서 주로 화장실에 배치하면 좋습니다. 
포름알데히르까지 제거해 새집증후군에도 도움이 됩니다. 
아레카야자와 마찬가지로 제습 식물 로도 좋습니다. 
인테리어 용으로는 갈색계열의 고가구와 잘 어울립니다.
2. 잘 크지 않는다. 성장 속도 느리다 

/*****************************************************
* 3. 대나무야자
******************************************************/
대나무야자 역시 아레카야자와 마찬가지로 실내 습도를 올리는 데 매우 효과적이라고 합니다. 
또한 마찬가지로 직사광선을 받으면 잎이 타기 때문에 양지와 음지가 적당히 조화된 곳에서 기르시는 것이 좋습니다. 
1m 이상의 대나무야자를 커다란 토분에 심어 TV 옆이나 소파 뒤쪽에 배치하면 실내 공기 질을 높이는 건 물론, 
이국적인 인테리어를 완성할 수 있습니다.


/*****************************************************
* 4. 인도고무나무
******************************************************/
잎이 넓은 인도고무나무는 머리를 맑게 해주고 공기 중의 유해물질을 잘 흡수합니다. 
관리 또한 쉬워서 누구나 쉽게 키울 수 있는 식물입니다.

/*****************************************************
* 5. 드라세나 자넷 크레이그
******************************************************/
드라세나 자넷 크레이그는 트리클로로 에틸렌이라는 휘발성 화학물질을 제거하는 뛰어난 능력을 가지고 있어서 
밀폐된 사무실같은 공간에 두시면 좋습니다. 
물이 부족하면 잎이 갈색으로 변하니 물 조절을 잘 하셔야 되며, 
그늘진 곳에 두면 물의 양을 양지에서보다 조금 더 적게 주시면 됩니다.

/* ############################################################################
*  그 외 미세먼지 식물 
##############################################################################*/

/*****************************************************
* 스킨답서스 
******************************************************/
1. 번식 짱  줄기 잘라서 수경 재배 하면 뿌리나온다. 

/* ############################################################################
*  물주기 
##############################################################################*/

/*****************************************************
* 물주기 정리
******************************************************/
1. 맑은날 오전 , 흙이 말랐으면 흠뻑 주기. 종종 잎에 분무 
2. 여름 : 이름 아침 , 늦은 저녁에 ,       겨울 : 따뜻한 시간에 실온과 비슷한 물 온도로 


/* ############################################################################
*  다육식물 키우기  
##############################################################################*/

/*****************************************************
* 유의 사항
******************************************************/
1. 다육식물은 실내에서 키울 수 없다 -> 베란다 등에서는 가능
2. 최소 4시간 이상 햇빛을 보기
3. 많은 양의 물은 안됨 적당하게 물 주기 ....  보통 한달에 한번 
4. 물을 준 후 통풍 유의하기 (건조하게)
5. 배수성이 좋은 마사토 활용 




