 
/* ############################################################################
*  실내공기정화식물순위 TOP5 - 나사 공식선정/미세먼지/인테리어화분/거실화분
##############################################################################*/

/*****************************************************
* 1. 아레카 야자 
******************************************************/
물주기 : 여름(1주일), 겨울(10일), 잎에 물을 뿌려주는게 좋다
햇빛 : 열대식물 10~12도 유지 , 직사광선 피해라, 햇빛이 없어도 잘 자람 
 - 줄기가 황색을 나타내는 것은 병든게 아니라 원래 특성이다 
- 잎이 처지거나 노랗게 변하면 물부족보다는 물이 많아서 그렇다. 약간 부족하게...

/*****************************************************
* 2. 관음죽
******************************************************/
관음죽은 낮은 기온에서도 아랑곳않는 내한성을 자랑하고, 병충해에도 강한 식물입니다. 
암모니아를 잘 흡수하는 특징이 있어서 주로 화장실에 배치하면 좋습니다. 
포름알데히르까지 제거해 새집증후군에도 도움이 됩니다. 
아레카야자와 마찬가지로 제습 식물 로도 좋습니다. 
인테리어 용으로는 갈색계열의 고가구와 잘 어울립니다.
2. 잘 크지 않는다. 성장 속도 느리다 

/*****************************************************
* 3. 대나무야자
******************************************************/
대나무야자 역시 아레카야자와 마찬가지로 실내 습도를 올리는 데 매우 효과적이라고 합니다. 
또한 마찬가지로 직사광선을 받으면 잎이 타기 때문에 양지와 음지가 적당히 조화된 곳에서 기르시는 것이 좋습니다. 
1m 이상의 대나무야자를 커다란 토분에 심어 TV 옆이나 소파 뒤쪽에 배치하면 실내 공기 질을 높이는 건 물론, 
이국적인 인테리어를 완성할 수 있습니다.


/*****************************************************
* 4. 인도고무나무
******************************************************/
잎이 넓은 인도고무나무는 머리를 맑게 해주고 공기 중의 유해물질을 잘 흡수합니다. 
관리 또한 쉬워서 누구나 쉽게 키울 수 있는 식물입니다.

/*****************************************************
* 5. 드라세나 자넷 크레이그
******************************************************/
드라세나 자넷 크레이그는 트리클로로 에틸렌이라는 휘발성 화학물질을 제거하는 뛰어난 능력을 가지고 있어서 
밀폐된 사무실같은 공간에 두시면 좋습니다. 
물이 부족하면 잎이 갈색으로 변하니 물 조절을 잘 하셔야 되며, 
그늘진 곳에 두면 물의 양을 양지에서보다 조금 더 적게 주시면 됩니다.

/*****************************************************
* 6.아이비
******************************************************/
공기청정기에 들어가는 헤파필터도 잡아내지 못하는 유해물질을 막아줄 수 있는 유전자 변형 식물
거실이나 베란다 등 중간 이상의 광도를 종아하고 통풍이 잘되면 아주 잘 자랍니다.
더운 것을 싫어하고 과습은 잎과 줄기를 힘없이 쳐지고 마르게 하는 원인이 됩니다
잎과 줄기에 기근이 있어서 잎에 수시로 스프레이를 해주면 좋습니다
뿌리가 뻗어나가면서 벽이나 철사를 타고 올라가는 특성이 있습니다
- 직광에는 잎이 탈수가 있깅 ㅔ반양지가 적합하며 물도 어느정도 좋아하기에 
  절절한 수분공급에 통풍이 잘되면 폭풍성장합니다
- 잎에 독소가 있기에 어린아이가 있거나 반려동물이 있으면 주의하세요 
- 수경재배로도 키울 수 있는 식물이니 물주기가 어려운 분은 수경재배로도 추천


/*****************************************************
* 헤데라 아이비
* 피닉스 야자
* 피쿠스아리
* 보스톤 고사리
* 스파티필름
* 행운목
* 포토스(스킨)
* 네프롤레피스 오블리테라타
* 포트맘(개량국화)
* 거베라
* 드라세나 와네키
* 드라세나 마지나타 
* 필로덴트론 에푸베스센스
* 싱고니움
* 디펜바키아 콤펙타 
******************************************************/




/* ############################################################################
*  그 외 미세먼지 식물 
##############################################################################*/

/*****************************************************
* 스킨답서스 
******************************************************/
1. 번식 짱  줄기 잘라서 수경 재배 하면 뿌리나온다. 

/*****************************************************
* 스투키  
******************************************************/
1. 잎의 색이 연두빛르로 변했다면 흙의 영양상태를 체크 후 분갈이 필요
2. 번식  (https://www.youtube.com/watch?v=tZuhGJSS2EY&t=13s) :
 -  2가지 방법 (1, 새순 자르기, 2. 엽삽)
 - 번신 적기 : 여름 성공률 50~100% , 
 - 스투키 줄기 하나를 3개로 잘라서 번식을 시도해도 됨 (생육기간 8개월 이상 )
 - 새순의 모주의 1/3 , 1/2 정도 자라면 분리시켜야 모주가 죽지 않는다 
 - 새순을 너무 작았을 경우 분리하면 새순이 잘 자라지 않는다.
 - 지하경 : 엄마(모주)옆으로 뿌리 또는 줄기 처럼 보이는 것처럼 옆으로 새순이 올라오는 것
 - 번식 후 생긴 단면으로 세균침투나 무름을 막기위해 한동안 물을 주지 않는다 
 - 스투키 새순의 모양
   1) 혀모양 (산세베리아로 회기하는 촉)
   2) 원통모양 (모주와 닮은 성질의 스투기 형)
   3) 혀모양 + 원통모양 
3. 분갈이 이유 :
 - 뿌리내릴 공간 확보, 새순 분리, 흙의 영양을 높이기 위해

/*****************************************************
* 산세베리아  (nasa 27위)
******************************************************/
1. 침실 거실 창가 모두 잘 자란다  , 원산지 : 서아프리카 열대지역, 인도
2. 음이온, 밤에 이산화탄소를 흡수하고 산소를 배출
3. 반양지, 반음지, 음지 모두 잘 자란다 
4. 월동 5도 이상,  성장 : 15~27도 
5. 물 : 물을 너무 많이 주면 뿌리가 썩거나 물러서 죽음 :  바닥까지 다 마르면 물을 준다 ,  나무젓가락으로 확인
 - 여름에도 1달에 한번 이지만 바닥까지 마르면 준다. 
 - 겨울에는 더 건조하게 관리  2달에 한번   
 
 5. 흙
  - 물빠짐이 좋은 흙인데 뭘까 ? 
 
 6. 번식(삽목)
  - 줄기를 자른다 -> 자른 줄기에 수분을 머금고 있어 두툼한 상태 확인
  - 자른 단면의 상처 치료 위해 2일 그냥 둔다
  - 뿌리가 내릴 수 있게 15cm 깊이로 삽목 함 
  - 물주기는 하지 않고 반그늘에 두어 3개월을 지켜본다. 
  
/* ############################################################################
* 영양제
##############################################################################*/

/*****************************************************
  * 다육이 식물 영양제
  * 쌀뜬물 + 과일 껍질 바나나는 필수 💖 식물을 튼튼하게 성장 시킴 그냥 물대신 줘도 됩니다 : 문제는 벌레가 날파리가 많이 낄 수 있으니 여름에는 사용하지 말것  
  ******************************************************/
  
  /*****************************************************
  * 관엽 식물(잎이 넓은) : 고무나무, 벤자민  
  ******************************************************/
  고기 핏물 + 물  (1: 3 ) 비율로 섞어주면 좋다   : 철분때문에 잎에 윤기가 흐르게 함 
  
/*****************************************************
* 천연비료   
******************************************************/
바나나껍질 (1/2) 컵 , 달걀 껍데기 1컵, 커피 찌꺼기 1컵 ,  물(1/2)컵을 믹서기에 갈기 ==>   햇볕에 말려  나중에    분갈이 흙 만들때 뿌리쪽에 넣어주면 좋다  

/*****************************************************
* 식초   : 곡물 식초 또는 쌀 식초 사용  
******************************************************/
- 식초를 물에 50배 희석하여 준다
- 잎의 뒷면에 충분히 살포 : 활력 제로서 뛰어난 능력 발휘  (식물이 약해져있을 때 효과)
- 잎이 요염하고 녹색 강도가 되살아 나고, 곰팡이 억제 살균 효과 , 질병에도 효과 
- 잎의 세포가 강하고 단단해 진다, 병해충에도 강해짐 , 더위에 지친 식물에도 효과적
- 토양에 스며 든 식초는 땅속의 해충을 제거하고 뿌리를 살찌게 양분의 흡수력을 높여준다


/* ############################################################################
*  물주기  
##############################################################################*/

/*****************************************************
* 물주기 정리
******************************************************/
1. 맑은날 오전 , 흙이 말랐으면 흠뻑 주기. 종종 잎에 분무 
2. 여름 : 이름 아침 , 늦은 저녁에 ,       겨울 : 따뜻한 시간에 실온과 비슷한 물 온도로 


/* ############################################################################
*  다육식물 키우기  
##############################################################################*/

/*****************************************************
* 유의 사항
******************************************************/
1. 다육식물은 실내에서 키울 수 없다 -> 베란다 등에서는 가능
2. 최소 4시간 이상 햇빛을 보기
3. 많은 양의 물은 안됨 적당하게 물 주기 ....  보통 한달에 한번 
4. 물을 준 후 통풍 유의하기 (건조하게)
5. 배수성이 좋은 마사토 활용 

/* ############################################################################
*  나무 
##############################################################################*/

/*****************************************************
* 콤펙타 
******************************************************/

/*****************************************************
* 해피트리 행복나무
******************************************************/

/* ############################################################################
*  흙
##############################################################################*/

/*****************************************************
* 마사토 : 물 잘 빠짐 
******************************************************/

/*****************************************************
* 용토 
******************************************************/

/*****************************************************
* 배양토 
******************************************************/


/* ############################################################################
*  삽목 (揷木) [삼목]
*  [명사] <농업> [같은 말] 꺾꽂이(식물의 가지, 줄기, 잎 따위를 자르거나 꺾어 흙 속에 꽂아 뿌리 내리게 하는 일). ‘꺾꽂이’로 순
##############################################################################*/





