 
/* ############################################################################
*  정보관리기술사  PEIM
*  Professional Engineer Information Management
##############################################################################*/

/*****************************************************
*  시험일정 
******************************************************/
 http://www.q-net.or.kr/crf005.do?id=crf00505&gSite=Q&gId=

 2019년 정기 기술사 118회	2019.04.12 ~ 2019.04.18	2019.05.05	2019.06.14	2019.06.17 ~ 2019.06.20	2019.07.13~2019.07.22	2019.08.02
 2019년 정기 기술사 119회	2019.07.19 ~ 2019.07.25	2019.08.10	2019.09.11	2019.09.16 ~ 2019.09.19	2019.11.02~2019.11.11	
 
 /*****************************************************
 ■ 진로 및 전망
 ******************************************************/
 - 정보통신부, 한국통신, 연구원 SI(system integrated)업체 (정보통신, 시스템구축회사 등)에 근무하거나 개인 사무소

   를 개설하여 운영한다. 「정보통신공사업법」에 따라 품질검사 전문기관의 기술인력과 정보시스템 수석감리원 자격

   을 취득하여 감리전문화 및 수석감리원으로 진출할 수 있다.

 - 정보화사회를 이행함에 따라 정보유통량이 증가하여 방대한 자료를 컴퓨터로 처리해야 할 필요성이 증대되고 있다.

   시스템구축 및 기존 시스템의 확장 등이 증가될 것이다. 새로운 시스템 구축을 결정하거나 개발할 때 기술적

   타당성을 검토하고 최종적으로 확인하며, 궁극적인 책임을 지는 의무와 권한을 행사하는 역할이 더욱 중요해질

   것이다. 따라서 이와 관련된 인력수요가 증가할 것으로 전망된다. 
   
 /*****************************************************
 ■ 정보관리기술사 출제경향 자세히 보기 - 최근 11회 정보관리 필기 출제영역
 ******************************************************/
 
 -- http://www.infoever.co.kr/Popup/Popup01.asp
 분야	95회	                    비중(%)
 소프트웨어 공학	        18.6
 데이터베이스               10.2
 엔터프라이즈 솔루션	    10
 디지털 컨버젼스	        25
 네트워크 / 보안            20.4
 IT 인프라                      8.8
 수치해석 / 확률통계	     7
 
 /*****************************************************
 ■  종목별 검정현황
 ******************************************************/
 종목명                    연도	        필기	                                        실기
                                       응시	합격	합격률	            응시  합격	  합격률
 정보관리기술사	      2017	666	28	      4.2%               46        36        78.2
 정보관리기술사	      2016	737	32	      4.8%               69        39        56.5%
 정보관리기술사	      2015	858	51	      5.9%               82        45        55%
 정보관리기술사	      2014	880	34	      3.9%               56        28        50%
 정보관리기술사	      2013	946	23	      2.4%               44        26        59.1%
 정보관리기술사	      2012	971	46	      4.7%               65        41        63.1%
 정보관리기술사       2011	1,103	24	      2.2%               54        30        55.6%
 정보관리기술사       2010	1,267	43	      3.4%               79        51        64.6%
 정보관리기술사	       2009	1,076	60	      5.6%               99        58        58.6%
 정보관리기술사  	   2008	813	32	      3.9%               77        49        63.6%
 정보관리기술사	       2007	990	26	       2.6%               46        29        63%
 
 /*****************************************************
 ■  
 ******************************************************/
 
 
 
 
 
 
 
 
 
 
 
 
 
 