 
/* ############################################################################
*  정보관리기술사  PEIM
*  Professional Engineer Information Management
##############################################################################*/

 /*****************************************************
 *   기술사  제 116 회 
 ******************************************************/

--  제 1 교시  (시험시간: 100분)

 ※ 다음 문제 중 10문제를 선택하여 설명하시오.  (각10점)

  1. 전자서명(Digital Signature)
  2. SQL(Structured Query Language)
  3. 해쉬 알고리즘(Hash Algorithm)
  4. 교착상태(Deadlock)
  5. 파스-타(PaaS-TA) 3.0              
  6. 제로 레이팅(Zero Rating)  
  7. 스피어 피싱(Spear Phishing)
  8. 레그테크(RegTech)
  9. CPU 보안 취약점에서의 스펙터(Spectre)
 10. F1 Score에서 정밀도(Precision), 재현율(Recall)
 11. 객체식별자 기반 사물인터넷 디바이스 식별체계(TTAK.KO-06.0365/R1)
 12. 포맷 스트링 공격(Format String Attack)
 13. 힐버트(Hilbert) R-tree 

 --  제 2교시  (시험시간: 100분)
 ※ 다음 문제 중 4문제를 선택하여 설명하시오.  (각25점)

1. 지능형 지속공격(APT, Advanced Persistent Threat)의 정의, 특징, 공격과정 및 대응방안을 관리적, 기술적 관점에서 설명하시오.
2. FTP(File Transfer Protocol), FTPS(FTP Secure) 및 SFTP(SSH FTP)의 정의 및 특징에 대하여 비교 설명하시오.
3. 4차 산업혁명의 개념 및 주요 정보화 활용 기술에 대하여 설명하시오.
4. 공공기관 정보화사업 예비타당성조사 제도의 필요성, 주요기준, 문제점 및 개선방향에 대하여 설명하시오.
5. IT 컴플라이언스(Compliance)의 주요 요구사항을 제시하고, 기업의 IT 컴플라이언스 위험 대응 방안을 인식 전환, 제도 및 기술 측면에서 설명하시오.
6. Unix 파일 시스템의 구조 및 /etc/passwd 파일의 구성에 대하여 설명하시오.

--  제 3 교시  (시험시간: 100분)
 ※ 다음 문제 중 4문제를 선택하여 설명하시오.  (각25점)

1. 이상금융거래 탐지시스템(FDS, Fraud Detection System)의 정의 및 주요기능, 이상금융거래 판정방식에 대하여 설명하시오.
2. 개인정보 보호에 관한 아래 사항에 대하여 설명하시오.
  가. 개인정보의 정의 및 유출 원인
  나. 오남용 행위 탐지 시나리오 생성방안별(4W1H, 데이터 생명주기) 생성기준 및 구성요소
  다. 오남용 행위 탐지 시나리오 생성방안별 사례 제시
3. 블록체인(Block Chain) 플랫폼의 보안 위협과 대응 방안에 대하여 설명하시오.
4. 스레드(Thread)와 멀티스레드(Multi-thread)의 개념, 스레드(Thread)와 프로세스(Process)의 차이점을 비교하여 설명하시오.  
5. 대기행렬이론(Queuing Theory)의 개념과 처리 기법에 대하여 설명하시오.
6. Socket 통신방식의 개념, TCP Socket 및 Web Socket 기술을 비교하여 설명하시오.
 
--  제 4 교시  (시험시간: 100분)
 ※ 다음 문제 중 4문제를 선택하여 설명하시오.  (각25점)

1. 데스크톱 가상화(VDI, Virtual Desktop Infrastructure)의 정의, 특징 및 계층별 구성요소에 대하여 설명하시오.
2. 디도스 공격(DDoS, Distributed Denial of Service Attack)에 대응하기 위한 클라우드 기반 보안서비스 구축 방식 모델인 스크러빙 센터(Scrubbing Center) 및 
	콘텐츠 전송네트워크(Content Delivery Network)의 대응방법, 대응규모, 대응시점, 암호화 트래픽 방어 여부, 기존 시스템 활용 관점에서 비교하여 설명하시오.
3. FIDO(Fast Identity Online) 1.0과 FIDO 2.0을 비교하여 설명하시오. 
4. 아키텍처 모델 중 기능의 분할과 배치 관점에서 데이터 중심형 모델, 클라이언트-서버 모델, 계층 모델 및 MVC(Model View Controller) 모델을 각각 설명하시오.
5. 영상감시시스템(Video Surveillance System)의 주요 요소인 영상 전처리 기술, 객체탐지 및 분류기술, 객체 추적 기술, 영상 보안 기술에 대하여 설명하시오.

6. 발주처는 BPR/PI 컨설팅 사업의 결과물에서 정성적 기대효과 뿐만 아니라, 정량적인 기대효과도 명확히 제시받기를 기대한다. 
  그러나 현재(As-is) 업무프로세스가 제대로 분석되었는지에 대한 신뢰성(Reliability) 부족과 미래(To-be) 개선 프로세스로 전환된 이후에 
  정량적 목표가 제대로 달성될지 여부에 대한 가시성(Visibility) 부족이 문제점으로 대두되고 있다. 
  최근 이러한 문제점을 개선하고 미래 비즈니스 프로세스의 정보자원 배치를 최적화하기 위한 시뮬레이션(Simulation) 기법이 활용되고 있는 데, 
  이 과정에서 진행되는 시뮬레이션의 개념, 진행 절차, 특징 및 정량적 지표(KPI) 도출 등에 대하여 설명하시오.

 