 
/* ############################################################################
*  정보관리기술사  PEIM
*  Professional Engineer Information Management
##############################################################################*/

 /*****************************************************
 *  합격수기 1 
 ******************************************************/
3.  공부방법

[학습초기]

기본 오브젝트와 암기노트를 시험 3개월전까지 모두 작성하고 중점적으로 암기했습니다.

암기하는 방법은 두음법칙과 무조건 많이 자주보기였습니다. 지금 외워지지 않는것 같아도 암기노트 돌리는 횟수가 늘어나면

어느새 머리속에 들어와 있습니다.

또 당시에 만들었던 카드형 암기노트로 대중교통을 이용하면서 계속 돌려봤습니다. 자투리시간을 어떻게 활용할지 고민해보세요

이때 소공 도메인을 많이 봤는데 이때 확실하게 암기한 기본 오브젝트가 다음 시험때 시간을 줄여주고 마지막 합격까지 이끌어준 원동력이 되었습니다.

또 이때부터 쓰기는 하루에 한번 or 두번(연습), 매주 멘토링 주간고사를 통해서 발전시키고 멘토님이 말씀하시는 문제를 고쳐갔습니다. 나중에 꾸준한 쓰기를 통한 템플릿의 차별화, 가독성이 제 강점이 됩니다.

 

[성숙기]

108회 시험에 떨어지고 전자신문을 구독하기 시작했습니다. 전자신문은 따로 도메인별로 엑셀등에 정리해서 암기노트 마지막에 추가적으로 봤습니다. 또 라이지움에서 하는 특강을 모두 봤는데 오프라인으로 들으면 좋겠지만 시간을 아끼기 위해

시험 직전에 온라인으로 몰아서 들었습니다.

초기에 많이 정복했던(?) 오브젝트는 상대적으로 우선순위를 낮추고 새로운 오브젝트 중심으로 암기노트를 정독했고

이때 암기노트는 엑셀로 확실히 카드형보다 한번 전체적으로 보는 시간이 줄어들었습니다.

모든 오브젝트를 동일하게 보는것보다 내가 암기가 안된 오브젝트가 무엇인지 체크하고 더 많이 보는 방법을 추천드립니다.


[마무리]

제가 중요하다고 선정한 오브젝트에 차별화 포인트(사례, 동향, 표준)을 찾아서 넣는데 주력했습니다.

이미 기본 키워드는 학습되어 있었고 오브젝트간 연계와 깊이, 차별화 중점으로 공부했습니다.

집중이 잘 되지 않을때는 녹음한 오브젝트를 들었는데 죄책감이 적으면서 휴식할 수 있는 좋은 방법이었습니다.

저는 중요하지만 오브젝트 볼때 뒤로 미루게 되는 CA를 20분정도(엑셀 두장) 분량으로 4건 정도 녹음했는데 효과가 좋았습니다.

녹음 파일도 암기노트도 가장 중요한것은 얼마나 반복해서 학습하는 것이라고 생각합니다.

 

4.  마음가짐  A(알콜), B(브로드캐스팅->TV), C(셀폰->핸드폰)


105회 합격하신 강면수 기술사님의 ABC를 끊어야 한다는 조언에 따라 A(알콜), B(브로드캐스팅->TV), C(셀폰->핸드폰)를 하지않으려고 노력했습니다. 

공부 기간에는 친구들과 약속은 물론 지인의 결혼식에도 가본적이 없습니다.

하루, 이틀 예외를 두면 점점 스스로를 통제하기 어려울것 같았습니다.

또 공부하면서 하루를 완전히 쉬게 되면 그 다음날부터 3일간 집중력이 떨어져서 컨디션이 좋지 않을때도 최소 2~3시간은 학습하는게 중요하다고 느꼈습니다.

공부가 잘 되지 않을때는 주간기술동향, 신문, 암기노트 문답, 산책, 합격수기 읽기(?) 등 가볍게 기분을 전환하시는 방법을 추천합니다.

 

5. 드리고 싶은 말씀

기술사 공부라는게 정말 고통스럽고 정말 내가 합격할 수 있을까?   

111회를 합격하고 느낀것은 공부는 내가 할 수 있는 모든 것을 다 하고 시험은 마음을 놓고 봐야한다는 것과 기회는 내가 실력을 갖추었을때 잡을 수 있다는것입니다.


  