 
/* ############################################################################
*  빅데이터 쉽게 이해하기
##############################################################################*/

/*****************************************************
*   
******************************************************/
1. 　빅데이터의 개요
41 분2. 　빅데이터의 가치와 영향
38 분3. 　빅데이터 비즈니스 모델
41 분4. 　빅데이터 활용 전략
38 분5. 　비즈니스 프로세스와 의사결정
38 분6. 　마케팅 애널리틱스
42 분7. 　생산 운영 애널리틱스
36 분8. 　회계 애널리틱스
46 분9. 　재무/인적자원 애널리틱스
35 분10.　빅데이터 분석 기획의 이해
37 분11.　빅데이터 분석 및 기획 접근법
41 분12.　통계 기반 데이터 분석
55 분13.　마이닝과 머신러닝 기반 데이터 분석
40 분14.　비정형(텍스트) 마이닝
42 분15.　데이터 시각화 기법과 이해
55 분16.　빅데이터 플랫폼과 관리
43 분17.　빅데이터 분석 도구








