 
/* ############################################################################
*  시크릿가든
##############################################################################*/

/*****************************************************
*  d0 
******************************************************/

   김수한무 
   거북이와 두루미 
   삼천갑자 동방삭	       
   치치카포 사리사리센타
   워리워리 세브리깡
   무두셀라 구름이
   허리케인 담벼락
   서생원에 고양이
   바둑이는 돌돌이 
   
  -- 두루미 : 86년이 최고 수명으로 기록
-- 육십갑자의 삼천 배. 곧 18만 년을 이른다. 
-- 중국 전한(前漢)의 문인(B.C.154?~B.C.93?).  속설에 서왕모의 복숭아를 훔쳐 먹어 장수하였으므로 삼천갑자 동방삭이라고 이른... 

김 수한무 (金壽限無) : 김은 성이고 목숨에 한계가 없다는 뜻
거북이와 두루미 : 십장생중에 나는 동물 이름입니다.  
삼천갑자 동방삭 : 옛날 중국에 三千甲子(180000년)를 살았던 동방삭이라는 사람
치치카포 : 아프리카 어디서 오래산사람 이름
사리사리센타, 워리워리,새프리카 : 모두 전설속 오래살았다고함
무두셀라 : 성경에 나오는 인물 969세 까지 살았다고 전해짐
구름이 : 구름이 오래사는 존재
허리케인 : 구름을 날려버림
담벼락 : 허리케인에도 무너지지 않음
서생원에 : 담벼락에 구멍을 뚫어 담벼락을 무너뜨림
고양이 : 서생원의 천적은 당근 고양이
바둑이는 : 고양이의 천적, 개
돌돌이 : 개 이름





