
/* ###########################################################################################
  *   
  * ######################################################################################### */
 
			 /********************************************************
			*   git 설치 
			*********************************************************/		
           - EGit git integration for eclipse 5.2.0  ---> 설치  : eclipse marketplace  
           - git project 생성
           - 
		
		

/********************************************************
*   git 설치 
*********************************************************/	
1. Git 에 들어가시면 3개의 항목이 있습니다. 이중에 Clone a Git repository 를 선택합니다.
2. 2개의 메뉴 중 Clone URI 를 선택합니다.
3. 개인의 깃허브 URI 와 아이디 패스워드를 입력해줍니다. port는 입력하지 않아도 됩니다.
4. 기본 Branch인 master를 선택합니다. 
5. 깃이 연동될 디렉토리를 선택해줍니다. local 의 저장소 지정하신다고 보시면 될 것같습니다.

6. git repositories 전환해서  import projects 하면 로컬로 다운로드 받아진다.
   - working tree 오른쪽 마우스   import projects   
   - close newly imported projects upon completion 체크 후 finish 눌러 종료한다 


/* ###########################################################################################
  *   이미 있는 프로젝트 git 커밋 시키기 
  * ######################################################################################### */



