 
/* ############################################################################
*  SQL 전문가 가이드(2013 EDITION)
##############################################################################*/

/*****************************************************
*  
******************************************************/
  
 
 SQL 전문가/개발자 자격검정 안내	1 
SQL 전문가/개발자란	2 
SQL 전문가의 정의	2 
SQL 전문가/개발자 자격검정의 필요성	3 
SQL 전문가/개발자의 직무	4 
자격검정 과목 안내	6 
자격검정 응시 안내	7 

과목 Ⅰ 데이터 모델링의 이해	10 
제1장 데이터 모델링의 이해	12 
제1절 데이터 모델의 이해	14 
제2절 엔터티(Entity)	37 
제3절 속성(Attribute)	46 
제4절 관계(Relationship)	53 
제5절 식별자	61 
장 요약	77 
연습문제	78 

제2장 데이터 모델과 성능	80 
제1절 성능 데이터 모델링의 개요	82 
제2절 정규화와 성능	85 
제3절 반정규화와 성능	96 
제4절 대량 데이터에 따른 성능	106 
제5절 데이터베이스 구조와 성능	114 
제6절 분산 데이터베이스와 성능	128 
장 요약	140 
연습문제	141 

과목 Ⅱ SQL 기본 및 활용	144 
제1장 SQL 기본	146 
제1절 관계형 데이터베이스 개요	148 
제2절 DDL(DATA DEFINITION LANGUAGE)	158 
제3절 DML(DATA MANIPULATION LANGUAGE)	182 
제4절 TCL(TRANSACTION CONTROL LANGUAGE)	193 
제5절 WHERE 절	207 
제6절 함수(FUNCTION)	227 
제7절 GROUP BY, HAVING 절	255 
제8절 ORDER BY 절	269 
제9절 조인(JOIN)	280 
장 요약	295 
연습문제	297 

제2장 SQL 활용	300 
제1절 표준 조인(STANDARD JOIN)	302 
제2절 집합 연산자(SET OPERATOR)	330 
제3절 계층형 질의와 셀프 조인	343 
제4절 서브쿼리	355 
제5절 그룹 함수(GROUP FUNCTION)	370 
제6절 윈도우 함수(WINDOW FUNCTION)	385 
제7절 DCL(DATA CONTROL LANGUAGE)	405 
제8절 절차형 SQL	418 
장 요약	441 
연습문제	442 

제3장 SQL 최적화 기본 원리	444 
제1절 옵티마이저와 실행계획	446 
제2절 인덱스 기본	454 
제3절 조인 수행 원리	461 
장 요약	466 
연습문제	467 

과목 Ⅲ SQL 고급 활용 및 튜닝	468 
제1장 아키텍처 기반 튜닝 원리	470 
제1절 데이터베이스 아키텍처	472 
제2절 SQL 파싱 부하	488 
제3절 데이터베이스 Call과 네트워크 부하	499 
제4절 데이터베이스 I/O 원리	516 
장 요약	528 
연습문제	530 

제2장 Lock과 트랜잭션 동시성 제어	532 
제1절 Lock	534 
제2절 트랜잭션	542 
제3절 동시성 제어	547 
장 요약	554 
연습문제	555 

제3장 옵티마이저 원리	556 
제1절 옵티마이저	558 
제2절 쿼리변환	571 
장 요약	593 
연습문제	594 

제4장 인덱스와 조인	596 
제1절 인덱스 기본 원리	598 
제2절 인덱스 튜닝	621 
제3절 조인 기본 원리	640 
제4절 고급 조인 기법	655 
장 요약	668 
연습문제	669 

제5장 고급 SQL 튜닝	672 
제1절 고급 SQL 활용	674 
제2절 소트 튜닝	689 
제3절 DML 튜닝	708 
제4절 파티션 활용	716 
제5절 배치 프로그램 튜닝	724 
장 요약	740 
연습문제	742 

부록 A. 데이터 형식, 함수 비교	744 
부록 B. 실행계획과 SQL 트레이스 분석	752 
부록 C. 연습문제 정답 및 해설	766 
부록 D. 핵심 용어 해설	778 
부록 E. 찾아보기	788 
 
 
 
 
 
 
 
 
 
 
 






